#pragma once

/**
 * Name: Hydroneer
 * Version: 1.7.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.PlaySoundJump
	 */
	struct ABP_GameCharacter_C_PlaySoundJump_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepWood
	 */
	struct ABP_GameCharacter_C_FootstepWood_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepDirt
	 */
	struct ABP_GameCharacter_C_FootstepDirt_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepWater
	 */
	struct ABP_GameCharacter_C_FootstepWater_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionTimeLine__FinishedFunc
	 */
	struct ABP_GameCharacter_C_ExplosionTimeLine__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionTimeLine__UpdateFunc
	 */
	struct ABP_GameCharacter_C_ExplosionTimeLine__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Timeline_0__FinishedFunc
	 */
	struct ABP_GameCharacter_C_Timeline_0__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Timeline_0__UpdateFunc
	 */
	struct ABP_GameCharacter_C_Timeline_0__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Jump_K2Node_InputActionEvent_20
	 */
	struct ABP_GameCharacter_C_InpActEvt_Jump_K2Node_InputActionEvent_20_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Jump_K2Node_InputActionEvent_19
	 */
	struct ABP_GameCharacter_C_InpActEvt_Jump_K2Node_InputActionEvent_19_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Crouch_K2Node_InputActionEvent_18
	 */
	struct ABP_GameCharacter_C_InpActEvt_Crouch_K2Node_InputActionEvent_18_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Crouch_K2Node_InputActionEvent_17
	 */
	struct ABP_GameCharacter_C_InpActEvt_Crouch_K2Node_InputActionEvent_17_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerForward_K2Node_InputActionEvent_16
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerForward_K2Node_InputActionEvent_16_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerForward_K2Node_InputActionEvent_15
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerForward_K2Node_InputActionEvent_15_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerBackward_K2Node_InputActionEvent_14
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerBackward_K2Node_InputActionEvent_14_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerBackward_K2Node_InputActionEvent_13
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerBackward_K2Node_InputActionEvent_13_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerLeft_K2Node_InputActionEvent_12
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerLeft_K2Node_InputActionEvent_12_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerLeft_K2Node_InputActionEvent_11
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerLeft_K2Node_InputActionEvent_11_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerRight_K2Node_InputActionEvent_10
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerRight_K2Node_InputActionEvent_10_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_PlayerRight_K2Node_InputActionEvent_9
	 */
	struct ABP_GameCharacter_C_InpActEvt_PlayerRight_K2Node_InputActionEvent_9_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Sprint_K2Node_InputActionEvent_8
	 */
	struct ABP_GameCharacter_C_InpActEvt_Sprint_K2Node_InputActionEvent_8_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_Sprint_K2Node_InputActionEvent_7
	 */
	struct ABP_GameCharacter_C_InpActEvt_Sprint_K2Node_InputActionEvent_7_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKSprint_K2Node_InputActionEvent_6
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKSprint_K2Node_InputActionEvent_6_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKSprint_K2Node_InputActionEvent_5
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKSprint_K2Node_InputActionEvent_5_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKJump_K2Node_InputActionEvent_4
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKJump_K2Node_InputActionEvent_4_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKJump_K2Node_InputActionEvent_3
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKJump_K2Node_InputActionEvent_3_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKCrouch_K2Node_InputActionEvent_2
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKCrouch_K2Node_InputActionEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpActEvt_CKCrouch_K2Node_InputActionEvent_1
	 */
	struct ABP_GameCharacter_C_InpActEvt_CKCrouch_K2Node_InputActionEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MouseUp_K2Node_InputAxisEvent_3_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4
	 */
	struct ABP_GameCharacter_C_InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ReceiveBeginPlay
	 */
	struct ABP_GameCharacter_C_ReceiveBeginPlay_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepTimer
	 */
	struct ABP_GameCharacter_C_FootstepTimer_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Forward
	 */
	struct ABP_GameCharacter_C_Forward_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Backwards
	 */
	struct ABP_GameCharacter_C_Backwards_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Left
	 */
	struct ABP_GameCharacter_C_Left_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.Right
	 */
	struct ABP_GameCharacter_C_Right_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FootstepTimer2
	 */
	struct ABP_GameCharacter_C_FootstepTimer2_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExplosionVignette
	 */
	struct ABP_GameCharacter_C_ExplosionVignette_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.NukeVignette
	 */
	struct ABP_GameCharacter_C_NukeVignette_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.FlyingHatVertTimer
	 */
	struct ABP_GameCharacter_C_FlyingHatVertTimer_Params
	{
	};

	/**
	 * Function BP_GameCharacter.BP_GameCharacter_C.ExecuteUbergraph_BP_GameCharacter
	 */
	struct ABP_GameCharacter_C_ExecuteUbergraph_BP_GameCharacter_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
