#pragma once

/**
 * Name: Hydroneer
 * Version: 1.7.2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.EmptyFuelSoundCheck
	 */
	struct ABP_ParentVehicle_C_EmptyFuelSoundCheck_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.FindSuitableExit
	 */
	struct ABP_ParentVehicle_C_FindSuitableExit_Params
	{
	public:
		bool                                                       Success;                                                 // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FVector                                             Location;                                                // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.SoundFadeOut__FinishedFunc
	 */
	struct ABP_ParentVehicle_C_SoundFadeOut__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.SoundFadeOut__UpdateFunc
	 */
	struct ABP_ParentVehicle_C_SoundFadeOut__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Timeline_0__FinishedFunc
	 */
	struct ABP_ParentVehicle_C_Timeline_0__FinishedFunc_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Timeline_0__UpdateFunc
	 */
	struct ABP_ParentVehicle_C_Timeline_0__UpdateFunc_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_Jump_K2Node_InputActionEvent_12
	 */
	struct ABP_ParentVehicle_C_InpActEvt_Jump_K2Node_InputActionEvent_12_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_Jump_K2Node_InputActionEvent_11
	 */
	struct ABP_ParentVehicle_C_InpActEvt_Jump_K2Node_InputActionEvent_11_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerLeft_K2Node_InputActionEvent_10
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerLeft_K2Node_InputActionEvent_10_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerLeft_K2Node_InputActionEvent_9
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerLeft_K2Node_InputActionEvent_9_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerRight_K2Node_InputActionEvent_8
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerRight_K2Node_InputActionEvent_8_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerRight_K2Node_InputActionEvent_7
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerRight_K2Node_InputActionEvent_7_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerForward_K2Node_InputActionEvent_6
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerForward_K2Node_InputActionEvent_6_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerForward_K2Node_InputActionEvent_5
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerForward_K2Node_InputActionEvent_5_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerBackward_K2Node_InputActionEvent_4
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerBackward_K2Node_InputActionEvent_4_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_PlayerBackward_K2Node_InputActionEvent_3
	 */
	struct ABP_ParentVehicle_C_InpActEvt_PlayerBackward_K2Node_InputActionEvent_3_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_CKJump_K2Node_InputActionEvent_2
	 */
	struct ABP_ParentVehicle_C_InpActEvt_CKJump_K2Node_InputActionEvent_2_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpActEvt_CKJump_K2Node_InputActionEvent_1
	 */
	struct ABP_ParentVehicle_C_InpActEvt_CKJump_K2Node_InputActionEvent_1_Params
	{
	public:
		struct FKey                                                Key;                                                     // 0x0000(0x0018)  (BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4
	 */
	struct ABP_ParentVehicle_C_InpAxisEvt_MouseRight_K2Node_InputAxisEvent_4_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.CheckFuel
	 */
	struct ABP_ParentVehicle_C_CheckFuel_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.ReceiveBeginPlay
	 */
	struct ABP_ParentVehicle_C_ReceiveBeginPlay_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.PostLoad
	 */
	struct ABP_ParentVehicle_C_PostLoad_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.LockMovement?
	 */
	struct ABP_ParentVehicle_C_LockMovement__Params
	{
	public:
		bool                                                       Lock_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.DecrementFuel
	 */
	struct ABP_ParentVehicle_C_DecrementFuel_Params
	{
	public:
		float                                                      AmountToDecrease;                                        // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.OverrideExitVehicle
	 */
	struct ABP_ParentVehicle_C_OverrideExitVehicle_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.OverrideRMB
	 */
	struct ABP_ParentVehicle_C_OverrideRMB_Params
	{
	public:
		bool                                                       Down_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.OverrideLMB
	 */
	struct ABP_ParentVehicle_C_OverrideLMB_Params
	{
	public:
		bool                                                       Down_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.OverrideActionKey
	 */
	struct ABP_ParentVehicle_C_OverrideActionKey_Params
	{
	public:
		bool                                                       Down_;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Enter Vehicle
	 */
	struct ABP_ParentVehicle_C_Enter_Vehicle_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.ExitVehicle
	 */
	struct ABP_ParentVehicle_C_ExitVehicle_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.OverrideEnterVehicle
	 */
	struct ABP_ParentVehicle_C_OverrideEnterVehicle_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.BndEvt__PhysicsCullSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
	 */
	struct ABP_ParentVehicle_C_BndEvt__PhysicsCullSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    OtherBodyIndex;                                          // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.TypeBPhysicsLock
	 */
	struct ABP_ParentVehicle_C_TypeBPhysicsLock_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.StartPhysicsBLock
	 */
	struct ABP_ParentVehicle_C_StartPhysicsBLock_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Left
	 */
	struct ABP_ParentVehicle_C_Left_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Right
	 */
	struct ABP_ParentVehicle_C_Right_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Forward
	 */
	struct ABP_ParentVehicle_C_Forward_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.Backwards
	 */
	struct ABP_ParentVehicle_C_Backwards_Params
	{
	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.ReceiveTick
	 */
	struct ABP_ParentVehicle_C_ReceiveTick_Params
	{
	public:
		float                                                      DeltaSeconds;                                            // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.BndEvt__FuelTankCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	 */
	struct ABP_ParentVehicle_C_BndEvt__FuelTankCollision_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature_Params
	{
	public:
		class UPrimitiveComponent*                                 OverlappedComponent;                                     // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class AActor*                                              OtherActor;                                              // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UPrimitiveComponent*                                 OtherComp;                                               // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    OtherBodyIndex;                                          // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       bFromSweep;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		struct FHitResult                                          SweepResult;                                             // 0x0000(0x0088)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.InpAxisEvt_MouseUp_K2Node_InputAxisEvent_1
	 */
	struct ABP_ParentVehicle_C_InpAxisEvt_MouseUp_K2Node_InputAxisEvent_1_Params
	{
	public:
		float                                                      AxisValue;                                               // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

	/**
	 * Function BP_ParentVehicle.BP_ParentVehicle_C.ExecuteUbergraph_BP_ParentVehicle
	 */
	struct ABP_ParentVehicle_C_ExecuteUbergraph_BP_ParentVehicle_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
