#ifndef UE4SS_SDK_S_DTFunctionless_HPP
#define UE4SS_SDK_S_DTFunctionless_HPP

struct FS_DTFunctionless
{
    FText Name_6_F7DF8D9644204240F823B7957E99127A;                                    // 0x0000 (size: 0x18)
    FText Description_7_72D3ABB040B2D309AE8AD38B9F03198C;                             // 0x0018 (size: 0x18)
    int32 StoreSellPrice_9_87B7F9F340952C3B014CF5888331009B;                          // 0x0030 (size: 0x4)
    FText URL_12_BDEBE72747BFD50FEFDAE89565A18D38;                                    // 0x0038 (size: 0x18)
    TEnumAsByte<E_PlacementType::Type> PlacementType_21_B2C702A846D4FE4D7F584D9AB4CEB3D9; // 0x0050 (size: 0x1)
    bool CanRTY?_25_290FAB484E0C0DDA5BC2429A81A6197A;                                 // 0x0051 (size: 0x1)
    class UStaticMesh* Mesh_30_7E1891BD4211200E9F0BCAB8D7DD4452;                      // 0x0058 (size: 0x8)
    class USoundBase* DropSound_15_047AD14B493506B16705209C6E5046F5;                  // 0x0060 (size: 0x8)
    class UStaticMesh* GridSquare_31_5D24B1F0427187E5917B3694993C9A72;                // 0x0068 (size: 0x8)

}; // Size: 0x70

#endif
