#pragma once

/**
 * Name: Hydroneer
 * Version: 2.1.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------

	/**
	 * AnimBlueprintGeneratedClass ABP_HydroGuy.ABP_HydroGuy_C
	 * Size -> 0x6BAD (FullSize[0x6E65] - InheritedSize[0x02B8])
	 */
	class UABP_HydroGuy_C : public UAnimInstance
	{
	public:

		unsigned char                                            UnknownData_IEOY[0x8];                                   // 0x02B8(0x0008) Fix Super Size


		struct FPointerToUberGraphFrame                          UberGraphFrame;                                          // 0x02C0(0x0008) ZeroConstructor, Transient, DuplicateTransient


		struct FAnimNode_Root                                    AnimGraphNode_Root;                                      // 0x02C8(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_39;                       // 0x02F8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_38;                       // 0x0320(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_28;                         // 0x0348(0x0080)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_9;                        // 0x03C8(0x00E8)


		struct FAnimNode_ApplyMeshSpaceAdditive                  AnimGraphNode_ApplyMeshSpaceAdditive_4;                  // 0x04B0(0x00D0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_29;                            // 0x0580(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_37;                       // 0x05B0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_36;                       // 0x05D8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_35;                       // 0x0600(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_34;                       // 0x0628(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_33;                       // 0x0650(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_32;                       // 0x0678(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_31;                       // 0x06A0(0x0028)


		struct FAnimNode_ApplyMeshSpaceAdditive                  AnimGraphNode_ApplyMeshSpaceAdditive_3;                  // 0x06C8(0x00D0)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_27;                         // 0x0798(0x0080)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_16;                          // 0x0818(0x0028)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_28;                            // 0x0840(0x0030)


		struct FAnimNode_ApplyMeshSpaceAdditive                  AnimGraphNode_ApplyMeshSpaceAdditive_2;                  // 0x0870(0x00D0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_15;                          // 0x0940(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_26;                         // 0x0968(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_27;                            // 0x09E8(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_30;                       // 0x0A18(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_29;                       // 0x0A40(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_28;                       // 0x0A68(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_27;                       // 0x0A90(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_25;                         // 0x0AB8(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_26;                            // 0x0B38(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_24;                         // 0x0B68(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_25;                            // 0x0BE8(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_23;                         // 0x0C18(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_24;                            // 0x0C98(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_22;                         // 0x0CC8(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_23;                            // 0x0D48(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_10;                           // 0x0D78(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_22;                            // 0x0E28(0x0030)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_14;                          // 0x0E58(0x0028)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_21;                            // 0x0E80(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_9;                            // 0x0EB0(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_20;                            // 0x0F60(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_8;                            // 0x0F90(0x00B0)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose_6;                          // 0x1040(0x0158)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_26;                       // 0x1198(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_25;                       // 0x11C0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_24;                       // 0x11E8(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_21;                         // 0x1210(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_19;                            // 0x1290(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_23;                       // 0x12C0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_22;                       // 0x12E8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_21;                       // 0x1310(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_20;                       // 0x1338(0x0028)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_8;                        // 0x1360(0x00E8)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_18;                            // 0x1448(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_19;                       // 0x1478(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_18;                       // 0x14A0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_17;                       // 0x14C8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_16;                       // 0x14F0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_15;                       // 0x1518(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_14;                       // 0x1540(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_20;                         // 0x1568(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_17;                            // 0x15E8(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_19;                         // 0x1618(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_16;                            // 0x1698(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_18;                         // 0x16C8(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_15;                            // 0x1748(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_7;                            // 0x1778(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_14;                            // 0x1828(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_17;                         // 0x1858(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_13;                            // 0x18D8(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_6;                            // 0x1908(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_12;                            // 0x19B8(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_13;                       // 0x19E8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_12;                       // 0x1A10(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_11;                       // 0x1A38(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_10;                       // 0x1A60(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_9;                        // 0x1A88(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_16;                         // 0x1AB0(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_11;                            // 0x1B30(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_15;                         // 0x1B60(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_10;                            // 0x1BE0(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_5;                            // 0x1C10(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_9;                             // 0x1CC0(0x0030)


		struct FAnimNode_TwoWayBlend                             AnimGraphNode_TwoWayBlend;                               // 0x1CF0(0x00C8)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_7;                        // 0x1DB8(0x00E8)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_6;                        // 0x1EA0(0x00E8)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_8;                             // 0x1F88(0x0030)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_8;                        // 0x1FB8(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_7;                        // 0x1FE0(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_6;                        // 0x2008(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_5;                        // 0x2030(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_4;                        // 0x2058(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_3;                        // 0x2080(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_14;                         // 0x20A8(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_7;                             // 0x2128(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_13;                         // 0x2158(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_6;                             // 0x21D8(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_12;                         // 0x2208(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_5;                             // 0x2288(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_4;                            // 0x22B8(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_4;                             // 0x2368(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_3;                            // 0x2398(0x00B0)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_3;                             // 0x2448(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine_2;                            // 0x2478(0x00B0)


		struct FAnimNode_Inertialization                         AnimGraphNode_Inertialization;                           // 0x2528(0x0070)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult_2;                        // 0x2598(0x0028)


		struct FAnimNode_TransitionResult                        AnimGraphNode_TransitionResult;                          // 0x25C0(0x0028)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_5;                        // 0x25E8(0x00E8)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_7;                           // 0x26D0(0x00C8)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_4;                        // 0x2798(0x00E8)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult_2;                             // 0x2880(0x0030)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_11;                         // 0x28B0(0x0080)


		struct FAnimNode_StateResult                             AnimGraphNode_StateResult;                               // 0x2930(0x0030)


		struct FAnimNode_StateMachine                            AnimGraphNode_StateMachine;                              // 0x2960(0x00B0)


		struct FAnimNode_Slot                                    AnimGraphNode_Slot_3;                                    // 0x2A10(0x0048)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose_5;                          // 0x2A58(0x0158)


		struct FAnimNode_ApplyMeshSpaceAdditive                  AnimGraphNode_ApplyMeshSpaceAdditive;                    // 0x2BB0(0x00D0)


		struct FAnimNode_BlendListByBool                         AnimGraphNode_BlendListByBool_5;                         // 0x2C80(0x00A0)


		struct FAnimNode_LayeredBoneBlend                        AnimGraphNode_LayeredBoneBlend_5;                        // 0x2D20(0x00C0)


		struct FAnimNode_Slot                                    AnimGraphNode_Slot_2;                                    // 0x2DE0(0x0048)


		struct FAnimNode_BlendListByBool                         AnimGraphNode_BlendListByBool_4;                         // 0x2E28(0x00A0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_13;                          // 0x2EC8(0x0028)


		struct FAnimNode_LayeredBoneBlend                        AnimGraphNode_LayeredBoneBlend_4;                        // 0x2EF0(0x00C0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_12;                          // 0x2FB0(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_10;                         // 0x2FD8(0x0080)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose_4;                          // 0x3058(0x0158)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_11;                          // 0x31B0(0x0028)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_10;                          // 0x31D8(0x0028)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_6;                           // 0x3200(0x00C8)


		struct FAnimNode_Slot                                    AnimGraphNode_Slot;                                      // 0x32C8(0x0048)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_9;                          // 0x3310(0x0080)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_5;                           // 0x3390(0x00C8)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_8;                          // 0x3458(0x0080)


		struct FAnimNode_LayeredBoneBlend                        AnimGraphNode_LayeredBoneBlend_3;                        // 0x34D8(0x00C0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_9;                           // 0x3598(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_7;                          // 0x35C0(0x0080)


		struct FAnimNode_LayeredBoneBlend                        AnimGraphNode_LayeredBoneBlend_2;                        // 0x3640(0x00C0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_8;                           // 0x3700(0x0028)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_3;                        // 0x3728(0x00E8)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer_2;                        // 0x3810(0x00E8)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_6;                          // 0x38F8(0x0080)


		unsigned char                                            UnknownData_9512[0x8];                                   // 0x3978(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FAnimNode_TwoBoneIK                               AnimGraphNode_TwoBoneIK_4;                               // 0x3980(0x01E0)


		struct FAnimNode_ConvertLocalToComponentSpace            AnimGraphNode_LocalToComponentSpace_4;                   // 0x3B60(0x0020)


		struct FAnimNode_ConvertComponentToLocalSpace            AnimGraphNode_ComponentToLocalSpace_4;                   // 0x3B80(0x0020)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose_3;                          // 0x3BA0(0x0158)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_7;                           // 0x3CF8(0x0028)


		struct FAnimNode_BlendListByBool                         AnimGraphNode_BlendListByBool_3;                         // 0x3D20(0x00A0)


		struct FAnimNode_TwoBoneIK                               AnimGraphNode_TwoBoneIK_3;                               // 0x3DC0(0x01E0)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_24;                             // 0x3FA0(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_23;                             // 0x40A8(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_22;                             // 0x41B0(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_21;                             // 0x42B8(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_20;                             // 0x43C0(0x0108)


		struct FAnimNode_ConvertLocalToComponentSpace            AnimGraphNode_LocalToComponentSpace_3;                   // 0x44C8(0x0020)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_19;                             // 0x44E8(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_18;                             // 0x45F0(0x0108)


		struct FAnimNode_ConvertComponentToLocalSpace            AnimGraphNode_ComponentToLocalSpace_3;                   // 0x46F8(0x0020)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_6;                           // 0x4718(0x0028)


		struct FAnimNode_TwoBoneIK                               AnimGraphNode_TwoBoneIK_2;                               // 0x4740(0x01E0)


		struct FAnimNode_ConvertLocalToComponentSpace            AnimGraphNode_LocalToComponentSpace_2;                   // 0x4920(0x0020)


		struct FAnimNode_ConvertComponentToLocalSpace            AnimGraphNode_ComponentToLocalSpace_2;                   // 0x4940(0x0020)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_17;                             // 0x4960(0x0108)


		unsigned char                                            UnknownData_ISM0[0x8];                                   // 0x4A68(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FAnimNode_TwoBoneIK                               AnimGraphNode_TwoBoneIK;                                 // 0x4A70(0x01E0)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_4;                           // 0x4C50(0x00C8)


		struct FAnimNode_RandomPlayer                            AnimGraphNode_RandomPlayer;                              // 0x4D18(0x0078)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose_2;                          // 0x4D90(0x0158)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_5;                           // 0x4EE8(0x0028)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_4;                           // 0x4F10(0x0028)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_16;                             // 0x4F38(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_15;                             // 0x5040(0x0108)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_3;                           // 0x5148(0x00C8)


		struct FAnimNode_SaveCachedPose                          AnimGraphNode_SaveCachedPose;                            // 0x5210(0x0158)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_3;                           // 0x5368(0x0028)


		struct FAnimNode_BlendListByBool                         AnimGraphNode_BlendListByBool_2;                         // 0x5390(0x00A0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose_2;                           // 0x5430(0x0028)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive_2;                           // 0x5458(0x00C8)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_14;                             // 0x5520(0x0108)


		struct FAnimNode_ConvertComponentToLocalSpace            AnimGraphNode_ComponentToLocalSpace;                     // 0x5628(0x0020)


		struct FAnimNode_ConvertLocalToComponentSpace            AnimGraphNode_LocalToComponentSpace;                     // 0x5648(0x0020)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_13;                             // 0x5668(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_12;                             // 0x5770(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_11;                             // 0x5878(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_10;                             // 0x5980(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_9;                              // 0x5A88(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_8;                              // 0x5B90(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_7;                              // 0x5C98(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_6;                              // 0x5DA0(0x0108)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_5;                          // 0x5EA8(0x0080)


		struct FAnimNode_BlendListByEnum                         AnimGraphNode_BlendListByEnum;                           // 0x5F28(0x00B0)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_4;                          // 0x5FD8(0x0080)


		struct FAnimNode_BlendListByBool                         AnimGraphNode_BlendListByBool;                           // 0x6058(0x00A0)


		struct FAnimNode_BlendSpacePlayer                        AnimGraphNode_BlendSpacePlayer;                          // 0x60F8(0x00E8)


		struct FAnimNode_ApplyAdditive                           AnimGraphNode_ApplyAdditive;                             // 0x61E0(0x00C8)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_3;                          // 0x62A8(0x0080)


		struct FAnimNode_BlendListByInt                          AnimGraphNode_BlendListByInt;                            // 0x6328(0x00A0)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer_2;                          // 0x63C8(0x0080)


		struct FAnimNode_LayeredBoneBlend                        AnimGraphNode_LayeredBoneBlend;                          // 0x6448(0x00C0)


		struct FAnimNode_UseCachedPose                           AnimGraphNode_UseCachedPose;                             // 0x6508(0x0028)


		struct FAnimNode_SequencePlayer                          AnimGraphNode_SequencePlayer;                            // 0x6530(0x0080)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_5;                              // 0x65B0(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_4;                              // 0x66B8(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_3;                              // 0x67C0(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone_2;                              // 0x68C8(0x0108)


		struct FAnimNode_ModifyBone                              AnimGraphNode_ModifyBone;                                // 0x69D0(0x0108)


		class ACharacter*                                        Character;                                               // 0x6AD8(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash


		struct FVector                                           Velocity;                                                // 0x6AE0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    Speed;                                                   // 0x6AEC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    Forward;                                                 // 0x6AF0(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    Right;                                                   // 0x6AF4(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    WalkRunAlpha;                                            // 0x6AF8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    RunSprintAlpha;                                          // 0x6AFC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    MovementAdditiveAlpha;                                   // 0x6B00(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    DeltaTimeX;                                              // 0x6B04(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    WalkPlayRate;                                            // 0x6B08(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    RunPlayRate;                                             // 0x6B0C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    CrouchPlayRate;                                          // 0x6B10(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    RotationRate;                                            // 0x6B14(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    TurnRate;                                                // 0x6B18(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     isMoving;                                                // 0x6B1C(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isSprinting;                                             // 0x6B1D(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isCrouched;                                              // 0x6B1E(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isForward;                                               // 0x6B1F(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isRight;                                                 // 0x6B20(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isTurningInPlace;                                        // 0x6B21(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isTurningRight;                                          // 0x6B22(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isTurningLeft;                                           // 0x6B23(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     isChangingDirection;                                     // 0x6B24(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		EMovementMode                                            MovementMode;                                            // 0x6B25(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		unsigned char                                            UnknownData_FC9K[0x2];                                   // 0x6B26(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FRotator                                          LastRotation;                                            // 0x6B28(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FVector                                           LastVelocity;                                            // 0x6B34(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		class UAnimSequence*                                     Pose;                                                    // 0x6B40(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     HasPose;                                                 // 0x6B48(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		unsigned char                                            UnknownData_B9SF[0x7];                                   // 0x6B49(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FTimerHandle                                      ClearPoseTimer;                                          // 0x6B50(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash


		E_ItemType                                               PoseItemType;                                            // 0x6B58(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     IsTwoHanded;                                             // 0x6B59(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		bool                                                     UseHandIK;                                               // 0x6B5A(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		unsigned char                                            UnknownData_8OWQ[0x1];                                   // 0x6B5B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FRotator                                          SpineRotation;                                           // 0x6B5C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FRotator                                          NeckRotation;                                            // 0x6B68(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FVector                                           HandEffectorR;                                           // 0x6B74(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           HandEffectorL;                                           // 0x6B80(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FRotator                                          EffectorRotationR;                                       // 0x6B8C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FRotator                                          EffectorRotationL;                                       // 0x6B98(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		unsigned char                                            UnknownData_298L[0x4];                                   // 0x6BA4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FTimerHandle                                      IK_FootTraceTimer;                                       // 0x6BA8(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash


		struct FVector                                           ActorLoc;                                                // 0x6BB0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           MeshLoc;                                                 // 0x6BBC(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           PelvisLoc;                                               // 0x6BC8(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           RightFootLoc;                                            // 0x6BD4(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           LeftFootLoc;                                             // 0x6BE0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    PelvisIK_Offset;                                         // 0x6BEC(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     RightFootIK;                                             // 0x6BF0(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		unsigned char                                            UnknownData_5GFV[0x3];                                   // 0x6BF1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		float                                                    FootIK_OffsetR;                                          // 0x6BF4(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    FootIK_OffsetL;                                          // 0x6BF8(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           FootEffectorR;                                           // 0x6BFC(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           FootEffectorL;                                           // 0x6C08(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           PelvisOffset;                                            // 0x6C14(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           FootEffectorR_Interp;                                    // 0x6C20(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           FootEffectorL_Interp;                                    // 0x6C2C(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           PelvisOffset_Interp;                                     // 0x6C38(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           LegJointTargetR;                                         // 0x6C44(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FVector                                           LegJointTargetL;                                         // 0x6C50(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		unsigned char                                            UnknownData_5XBM[0x4];                                   // 0x6C5C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		class ABP_Character_HydroGuy_C*                          HydroGuyRef;                                             // 0x6C60(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash


		unsigned char                                            UnknownData_SC0M[0x8];                                   // 0x6C68(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		struct FTransform                                        Upper_Head_Transform;                                    // 0x6C70(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Lower_Head_Transform;                                    // 0x6CA0(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Forehead_Transform;                                      // 0x6CD0(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        NoseTransform;                                           // 0x6D00(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Chin_Transform;                                          // 0x6D30(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Ear_Right_Transform;                                     // 0x6D60(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Ear_Left_Transform;                                      // 0x6D90(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Eyebrow_Right_Transform;                                 // 0x6DC0(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		struct FTransform                                        Eyebrow_Left_Transform;                                  // 0x6DF0(0x0030) Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor


		class UAnimSequence*                                     VehiclePose;                                             // 0x6E20(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     HasVehiclePose;                                          // 0x6E28(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		E_Vehicle                                                VehicleType;                                             // 0x6E29(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		unsigned char                                            UnknownData_M0C5[0x2];                                   // 0x6E2A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		float                                                    Steering;                                                // 0x6E2C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    FemAlpha;                                                // 0x6E30(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    IdleTimeOffset;                                          // 0x6E34(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		int32_t                                                  PoseMode;                                                // 0x6E38(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		float                                                    PoseBlendTime;                                           // 0x6E3C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		class AActor*                                            TargetActor;                                             // 0x6E40(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		struct FRotator                                          LookAtRotation;                                          // 0x6E48(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


		unsigned char                                            UnknownData_W19F[0x4];                                   // 0x6E54(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)


		class ABP_NPC_C*                                         NPC_ref;                                                 // 0x6E58(0x0008) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash


		float                                                    SpeakingAlpha;                                           // 0x6E60(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash


		bool                                                     isSpeaking;                                              // 0x6E64(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor


	public:

		void AnimGraph(
struct FPoseLink* AnimGraph
);

		void LookAtActor();

		void SetFaceTransforms();

		void IK_FootTrace(
const struct FVector& SocketLocation
, 
float* IK_Offset
);

		void FootIK_Lerp();

		void FootIK();

		void ClearPose();

		void UpdatePose(
class UAnimSequence* NewPose
, 
int32_t PoseMode
, 
float PoseBlendTime
);

		void MovementCalculations();

		void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HydroGuy_AnimGraphNode_ModifyBone_FA3EBD9C434F2DF6E2DA0284F2577BD6();

		void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HydroGuy_AnimGraphNode_ModifyBone_908D17CA41C5E2CDE9053F828D4995CC();

		void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HydroGuy_AnimGraphNode_ModifyBone_B5905587412CA095EACFD1B385FFBD80();

		void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_HydroGuy_AnimGraphNode_ModifyBone_38B281C74CBE0B9F98E84BB65248A3F7();

